<?xml version="1.0" ?>
<net name="model" version="10">
	<layers>
		<layer id="0" name="Placeholder" type="Parameter" version="opset1">
			<data shape="1, 3, 416, 416" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Placeholder:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="17583264" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="17643222" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_7" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="layer1_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer1_conv/pad_size:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>418</dim>
					<dim>418</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="layer1_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="36" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="layer1_conv/weights:0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="layer1_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>418</dim>
					<dim>418</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer1_conv/Conv2D:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="layer1_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1764" size="64"/>
			<output>
				<port id="0" precision="FP32" names="layer1_conv/biases:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="layer1_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer1_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="layer1_leaky/weights20553216" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="layer1_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer1_leaky:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="pool1" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="17703198" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="17763237" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_28" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="layer2_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer2_conv/pad_size:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>210</dim>
					<dim>210</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="layer2_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="1832" size="18432"/>
			<output>
				<port id="0" precision="FP32" names="layer2_conv/weights:0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="layer2_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>210</dim>
					<dim>210</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer2_conv/Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="layer2_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="20264" size="128"/>
			<output>
				<port id="0" precision="FP32" names="layer2_conv/biases:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="layer2_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer2_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="layer2_leaky/weights20753189" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="layer2_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer2_leaky:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="pool2" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool2:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="17823147" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="17883225" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_49" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="layer3_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer3_conv/pad_size:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>106</dim>
					<dim>106</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="layer3_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="20392" size="73728"/>
			<output>
				<port id="0" precision="FP32" names="layer3_conv/weights:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="layer3_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>106</dim>
					<dim>106</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer3_conv/Conv2D:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="layer3_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="94120" size="256"/>
			<output>
				<port id="0" precision="FP32" names="layer3_conv/biases:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="layer3_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer3_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="layer3_leaky/weights20673246" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="layer3_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer3_leaky:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="pool3" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool3:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="17943213" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="18003234" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_70" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="layer4_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer4_conv/pad_size:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>54</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="layer4_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="94376" size="294912"/>
			<output>
				<port id="0" precision="FP32" names="layer4_conv/weights:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="layer4_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>54</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer4_conv/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="layer4_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="389288" size="512"/>
			<output>
				<port id="0" precision="FP32" names="layer4_conv/biases:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="layer4_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer4_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="layer4_leaky/weights20713150" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="layer4_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer4_leaky:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="pool4" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool4:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="18063243" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="18123231" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_91" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="layer5_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer5_conv/pad_size:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="layer5_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="389800" size="1179648"/>
			<output>
				<port id="0" precision="FP32" names="layer5_conv/weights:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="layer5_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer5_conv/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="layer5_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1569448" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="layer5_conv/biases:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="layer5_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer5_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="layer5_leaky/weights20833258" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="layer5_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer5_leaky:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="pool5" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool5:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="18183249" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="18243210" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_112" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="layer6_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer6_conv/pad_size:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="layer6_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="1570472" size="4718592"/>
			<output>
				<port id="0" precision="FP32" names="layer6_conv/weights:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="layer6_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer6_conv/Conv2D:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="layer6_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="6289064" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="layer6_conv/biases:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="layer6_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer6_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="layer6_leaky/weights20593192" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="layer6_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer6_leaky:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="pool6" type="MaxPool" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="1, 1" kernel="2, 2" rounding_type="floor" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="pool6:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="18303240" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="18363165" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_133" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="layer7_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer7_conv/pad_size:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="layer7_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 512, 3, 3" offset="6291112" size="18874368"/>
			<output>
				<port id="0" precision="FP32" names="layer7_conv/weights:0">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="layer7_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer7_conv/Conv2D:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="layer7_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1024, 1, 1" offset="25165480" size="4096"/>
			<output>
				<port id="0" precision="FP32" names="layer7_conv/biases:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="layer7_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer7_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="layer7_leaky/weights20633177" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="layer7_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer7_leaky:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="18423186" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="18483159" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_152" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="32" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="layer8_conv/pad_size" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="layer8_conv/pad_size:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="layer8_conv/weights" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1024, 3, 3" offset="25169576" size="18874368"/>
			<output>
				<port id="0" precision="FP32" names="layer8_conv/weights:0">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="layer8_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer8_conv/Conv2D:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="layer8_conv/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="44043944" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="layer8_conv/biases:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="layer8_conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer8_conv/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="layer8_leaky/weights20793180" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1828" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="layer8_leaky" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer8_leaky:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="m_outputs0/weights" type="Const" version="opset1">
			<data element_type="f32" shape="65, 512, 1, 1" offset="44045992" size="133120"/>
			<output>
				<port id="0" precision="FP32" names="m_outputs0/weights:0">
					<dim>65</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="m_outputs0/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>65</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="m_outputs0/Conv2D:0">
					<dim>1</dim>
					<dim>65</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="m_outputs0/biases" type="Const" version="opset1">
			<data element_type="f32" shape="1, 65, 1, 1" offset="44179112" size="260"/>
			<output>
				<port id="0" precision="FP32" names="m_outputs0/biases:0">
					<dim>1</dim>
					<dim>65</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="m_outputs0/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>65</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>65</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="m_outputs0/BiasAdd:0,model_outputs:0">
					<dim>1</dim>
					<dim>65</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="m_outputs0/BiasAdd:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>65</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="2" from-port="0" to-layer="4" to-port="2"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="3"/>
		<edge from-layer="4" from-port="4" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="12" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="13" from-port="0" to-layer="15" to-port="2"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="3"/>
		<edge from-layer="15" from-port="4" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1"/>
		<edge from-layer="21" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="23" from-port="0" to-layer="26" to-port="1"/>
		<edge from-layer="24" from-port="0" to-layer="26" to-port="2"/>
		<edge from-layer="25" from-port="0" to-layer="26" to-port="3"/>
		<edge from-layer="26" from-port="4" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="0" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="34" from-port="0" to-layer="37" to-port="1"/>
		<edge from-layer="35" from-port="0" to-layer="37" to-port="2"/>
		<edge from-layer="36" from-port="0" to-layer="37" to-port="3"/>
		<edge from-layer="37" from-port="4" to-layer="39" to-port="0"/>
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1"/>
		<edge from-layer="39" from-port="2" to-layer="41" to-port="0"/>
		<edge from-layer="40" from-port="0" to-layer="41" to-port="1"/>
		<edge from-layer="41" from-port="2" to-layer="43" to-port="0"/>
		<edge from-layer="42" from-port="0" to-layer="43" to-port="1"/>
		<edge from-layer="43" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="44" from-port="1" to-layer="48" to-port="0"/>
		<edge from-layer="45" from-port="0" to-layer="48" to-port="1"/>
		<edge from-layer="46" from-port="0" to-layer="48" to-port="2"/>
		<edge from-layer="47" from-port="0" to-layer="48" to-port="3"/>
		<edge from-layer="48" from-port="4" to-layer="50" to-port="0"/>
		<edge from-layer="49" from-port="0" to-layer="50" to-port="1"/>
		<edge from-layer="50" from-port="2" to-layer="52" to-port="0"/>
		<edge from-layer="51" from-port="0" to-layer="52" to-port="1"/>
		<edge from-layer="52" from-port="2" to-layer="54" to-port="0"/>
		<edge from-layer="53" from-port="0" to-layer="54" to-port="1"/>
		<edge from-layer="54" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="55" from-port="1" to-layer="59" to-port="0"/>
		<edge from-layer="56" from-port="0" to-layer="59" to-port="1"/>
		<edge from-layer="57" from-port="0" to-layer="59" to-port="2"/>
		<edge from-layer="58" from-port="0" to-layer="59" to-port="3"/>
		<edge from-layer="59" from-port="4" to-layer="61" to-port="0"/>
		<edge from-layer="60" from-port="0" to-layer="61" to-port="1"/>
		<edge from-layer="61" from-port="2" to-layer="63" to-port="0"/>
		<edge from-layer="62" from-port="0" to-layer="63" to-port="1"/>
		<edge from-layer="63" from-port="2" to-layer="65" to-port="0"/>
		<edge from-layer="64" from-port="0" to-layer="65" to-port="1"/>
		<edge from-layer="65" from-port="2" to-layer="66" to-port="0"/>
		<edge from-layer="66" from-port="1" to-layer="70" to-port="0"/>
		<edge from-layer="67" from-port="0" to-layer="70" to-port="1"/>
		<edge from-layer="68" from-port="0" to-layer="70" to-port="2"/>
		<edge from-layer="69" from-port="0" to-layer="70" to-port="3"/>
		<edge from-layer="70" from-port="4" to-layer="72" to-port="0"/>
		<edge from-layer="71" from-port="0" to-layer="72" to-port="1"/>
		<edge from-layer="72" from-port="2" to-layer="74" to-port="0"/>
		<edge from-layer="73" from-port="0" to-layer="74" to-port="1"/>
		<edge from-layer="74" from-port="2" to-layer="76" to-port="0"/>
		<edge from-layer="75" from-port="0" to-layer="76" to-port="1"/>
		<edge from-layer="76" from-port="2" to-layer="80" to-port="0"/>
		<edge from-layer="77" from-port="0" to-layer="80" to-port="1"/>
		<edge from-layer="78" from-port="0" to-layer="80" to-port="2"/>
		<edge from-layer="79" from-port="0" to-layer="80" to-port="3"/>
		<edge from-layer="80" from-port="4" to-layer="82" to-port="0"/>
		<edge from-layer="81" from-port="0" to-layer="82" to-port="1"/>
		<edge from-layer="82" from-port="2" to-layer="84" to-port="0"/>
		<edge from-layer="83" from-port="0" to-layer="84" to-port="1"/>
		<edge from-layer="84" from-port="2" to-layer="86" to-port="0"/>
		<edge from-layer="85" from-port="0" to-layer="86" to-port="1"/>
		<edge from-layer="86" from-port="2" to-layer="88" to-port="0"/>
		<edge from-layer="87" from-port="0" to-layer="88" to-port="1"/>
		<edge from-layer="88" from-port="2" to-layer="90" to-port="0"/>
		<edge from-layer="89" from-port="0" to-layer="90" to-port="1"/>
		<edge from-layer="90" from-port="2" to-layer="91" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.2-3976-0943ed67223-refs/pull/539/head"/>
		<cli_parameters>
			<batch value="1"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model value="DIR\model.pb"/>
			<input_model_is_text value="False"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="DEBUG"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
